#include <stdio.h>

int main() {
    // กรณีที่ 1: ประกาศ score เป็น int และกำหนดค่า 90.5
    int score_int = 90.5;  // float 90.5 ถูกแปลงเป็น int โดยตัดทศนิยมทิ้ง
    printf("int score = %d\n", score_int); // ผลลัพธ์จะแสดง 90

    // กรณีที่ 2: ประกาศ score เป็น float และกำหนดค่า 90.5
    float score_float = 90.5;
    printf("float score = %.1f\n", score_float); // ผลลัพธ์จะแสดง 90.5

    return 0;
}
//1.ผลลัพธ์ที่ได้ต่างกันอย่างไร?
//กรณี int จะเก็บเฉพาะเลขจำนวนเต็มดังนั้น 90.5 จะถูกเก็บเป็น 90
//กรณี float จะเก็บค่าเลขทศนิยมได้เต็มที่ ผลลัพธ์จึงเป็น 90.5 

//2.ทำไมต้องเลือก Data Type ให้ถูกต้อง?
//เพราะ Data Type กำหนดรูปแบบและขนาดของข้อมูลในหน่วยความจำ
//ถ้าเลือกผิด เช่น เก็บค่าทศนิยมในตัวแปร int จะทำให้ข้อมูลสูญเสียความถูกต้อง (ตัดทศนิยมทิ้ง)
//การเลือก Data Type ถูกต้องช่วยให้โปรแกรมทำงานถูกต้องและประสิทธิภาพดีขึ้น

//3.อธิบายและสรุปผลที่ได้จากการทดลอง
//การประกาศตัวแปรด้วยชนิดข้อมูลที่ไม่ตรงกับค่าที่จะเก็บ อาจทำให้ข้อมูลผิดเพี้ยน เช่น เลขทศนิยมเก็บใน int
//ข้อมูลใน float สามารถเก็บทศนิยมได้แม่นยำกว่าตัวแปร int
//จึงควรเลือกชนิดข้อมูลให้เหมาะสมกับลักษณะข้อมูลที่จะเก็บ เพื่อป้องกันข้อผิดพลาดในโปรแกรม

